SURV/src/DataProcessors/ЗагрузкаКалендаря/ЗагрузкаКалендаря.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ЗагрузкаКалендаря</name>
  <attributes>
    <name>НаДату</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Сервер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>БазаДанных</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Пароль</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:DataProcessor>

SURV/src/DataProcessors/ЗагрузкаКалендаря/Forms/Форма/Module.bsl
&НаКлиенте
Процедура Загрузить(Команда)
	ПараметрыСоединения = "Srvr="""+СокрЛП(Объект.Сервер)+""";Ref="""+СокрЛП(Объект.БазаДанных)+""";Usr="""+СокрЛП(Объект.Пользователь)+""";Pwd="""+СокрЛП(Объект.Пароль)+""";";
	Сервер.ЗагрузитьПроизводственныйКалендарь(ПараметрыСоединения,Объект.НаДату);
	ПоказатьПредупреждение(Неопределено, "Готово!",2);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Объект.НаДату = ТекущаяДата();
	Объект.Сервер = "rumos04";
	Объект.БазаДанных = "mo_8";
	Объект.Пользователь = "Абасов А.А.";
КонецПроцедуры
